---
kind: other
id: Methods.T:Autodesk.Revit.DB.ConicalSurface
source: html/0de78575-d6d5-d00d-39b4-4972c6c54d73.htm
---
# ConicalSurface Methods

Creates a conical surface defined by a local reference frame and a half angle.